import * as yup from "yup";

export const userInfoValidation = yup.object({
    userName: yup.string().min(3, "نام کاربری شامل 3 تا 30 کاراکتر است").max(30,"نام کاربری شامل 3 تا 30 کاراکتر است").matches(/^[a-zA-Z][a-zA-Z0-9._]{2,29}$/,"نام کاربری باید با حروف انگلیسی شروع شود"),
    firstName: yup.string()
    .matches(/^[\u0600-\u06FF\s]+$|^[a-zA-Z\s]+$/, "نام باید شامل حروف فارسی یا انگلیسی باشد")
    .min(3, "نام باید حداقل 3 کاراکتر باشد")
    .max(30, "نام و نام خانوادگی باید حداکثر 30 کاراکتر باشد"),
    lastName: yup.string()
    .matches(/^[\u0600-\u06FF\s]+$|^[a-zA-Z\s]+$/, "نام باید شامل حروف فارسی یا انگلیسی باشد")
    .min(3, " نام خانوادگی باید حداقل 3 کاراکتر باشد")
    .max(30, " نام خانوادگی باید حداکثر 30 کاراکتر باشد"),
    email: yup.string()
    .email("فرمت ایمیل نادرست است")
})

export const changePasswordValidation = yup.object({
    password: yup.string().min(8, "رمز عبور باید حداقل 8 کاراکتر باشد").max(20, "رمز عبور باید حداکثر 20 کاراکتر باشد").matches(/^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&*]).{8,}$/, "رمزعبور باید شامل حروف کوچک و بزرگ انگلیسی،اعداد و نشانه های خاص باشد").required("رمز عبور فعلی خود را وارد کنید"),
    newPassword: yup.string().min(8, "رمز عبور باید حداقل 8 کاراکتر باشد").max(20, "رمز عبور باید حداکثر 20 کاراکتر باشد").matches(/^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&*]).{8,}$/, "رمزعبور باید شامل حروف کوچک و بزرگ انگلیسی،اعداد و نشانه های خاص باشد").required("رمز عبور جدید خود را وارد کنید"),
    confirmPassword: yup.string().min(8).max(20).matches(/^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&*]).{8,}$/).oneOf([yup.ref("newPassword"), undefined], "رمز عبور جدید با تکرار آن مطابقت ندارد").required("رمز عبور جدید خود را تکرار کنید"),
})